#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "Expensive Drugs for Rare Disease" -> "Expensive Drugs for Rare Disease - Case Management"
        id                                         = "4972d3e8-1c2e-4886-b066-02e2fc43cb2c"
        name                                       = "EDRD"
      ~ valid_redirect_uris                        = [
          - "https://bchealth--edrddev.sandbox.my.site.com/edrdportal/*",
          - "https://bchealth--edrdqa.sandbox.my.site.com/edrdportalQA/*",
          - "https://bchealth--edrduat.sandbox.my.site.com/*",
            # (3 unchanged elements hidden)
        ]
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "300"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "EDRD-PORTAL"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Expensive Drugs for Rare Disease - Portal for Prescribers"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "EDRD-PORTAL"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://bchealth--edrddev.sandbox.my.site.com/*",
          + "https://bchealth--edrdqa.sandbox.my.site.com/*",
          + "https://bchealth--edrduat.sandbox.my.site.com/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.keycloak_openid_user_attribute_protocol_mapper.cpn will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "cpn" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "common_provider_number"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "cpn"
      + realm_id             = "moh_applications"
      + user_attribute       = "common_provider_number"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-EDRD will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-EDRD" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "EDRD"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for EDRD"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-LICENCE-STATUS will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-LICENCE-STATUS" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "LICENCE-STATUS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for LICENCE-STATUS"
      + realm_id                    = "moh_applications"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*